<a href="https://colab.research.google.com/github/OlegSavelev2001/Pis3/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

1. Id number: 1 to 214
2. RI: refractive index
3. Na: Sodium (unit measurement: weight percent in corresponding oxide, as are attributes 4-10)
4. Mg: Magnesium
5. Al: Aluminum
6. Si: Silicon
7. K: Potassium
8. Ca: Calcium
9. Ba: Barium
10. Fe: Iron
11. Type of glass: (class attribute)
-- 1 building_windows_float_processed
-- 2 building_windows_non_float_processed
-- 3 vehicle_windows_float_processed
-- 4 vehicle_windows_non_float_processed (none in this database)
-- 5 containers
-- 6 tableware
-- 7 headlamps

In [2]:
data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data', header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [3]:
names = ['Id','RI','Na','Mg','Al','Si','K','Ca','Ba','Fe','Class']
data.columns = names
data = data.drop(columns = ['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [4]:
data['Class'].replace({1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps"
                      }, inplace=True)
data.head(7)

        RI     Na    Mg    Al     Si     K    Ca   Ba    Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.00  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.00  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.00  building_float
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.00  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.00  building_float
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.0  0.26  building_float
6  1.51743  13.30  3.60  1.14  73.09  0.58  8.17  0.0  0.00  building_float

In [6]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      203 non-null    float64
 2   Mg      201 non-null    float64
 3   Al      195 non-null    float64
 4   Si      199 non-null    float64
 5   K       201 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   195 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

# Data Vizualization

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      203 non-null    float64
 2   Mg      201 non-null    float64
 3   Al      195 non-null    float64
 4   Si      199 non-null    float64
 5   K       201 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   195 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [9]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  199.000000  203.000000  201.000000  ...  203.000000  199.000000  199.000000
mean     1.518298   13.404729    2.689751  ...    8.941527    0.180955    0.059196
std      0.003051    0.825891    1.439432  ...    1.412930    0.510668    0.099063
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516485   12.910000    2.090000  ...    8.240000    0.000000    0.000000
50%      1.517640   13.300000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519130   13.820000    3.600000  ...    9.165000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [12]:
display(data['Class'].describe())
print('=============================')
display(data['Class'].value_counts())

count                    195
unique                     6
top       building_non_float
freq                      68
Name: Class, dtype: object

=============================

building_non_float    68
building_float        63
headlamps             28
vehicle_float         15
containers            12
tableware              9
Name: Class, dtype: int64